test/fixtures/json/orders_sent.json

{"collection":[{"orderNumber":35071,"templates":{"upgradeInstructions":"https://restapi.e-conomic.com/orders/sent/35071/templates/upgrade-instructions/draftInvoice","self":"https://restapi.e-conomic.com/orders/sent/35071/templates"},"soap":{"orderHandle":{"id":30}},"attachment":"https://restapi.e-conomic.com/orders/sent/35071/attachment","lines":[],"date":"2019-01-21","currency":"DKK","exchangeRate":100.000000,"netAmount":880.000000,"netAmountInBaseCurrency":880.00,"grossAmount":1100.00,"grossAmountInBaseCurrency":1100.00,"marginInBaseCurrency":880.00,"marginPercentage":100.00,"vatAmount":220.000000,"roundingAmount":0.00,"costPriceInBaseCurrency":0.0000,"dueDate":"2019-02-20","paymentTerms":{"paymentTermsNumber":5,"daysOfCredit":30,"name":"Netto 30 dage","paymentTermsType":"net","self":"https://restapi.e-conomic.com/payment-terms/5"},"customer":{"customerNumber":1000,"self":"https://restapi.e-conomic.com/customers/1000"},"recipient":{"name":"Møbelfabrikken A/S","address":"Møtrikvej 1","zip":"2750","city":"Ballerup","vatZone":{"vatZoneNumber":1,"self":"https://restapi.e-conomic.com/vat-zones/1"},"nemHandelType":"ean"},"layout":{"layoutNumber":19,"self":"https://restapi.e-conomic.com/layouts/19"},"pdf":{"download":"https://restapi.e-conomic.com/orders/sent/35071/pdf"},"self":"https://restapi.e-conomic.com/orders/sent/35071"}],"pagination":{"maxPageSizeAllowed":1000,"skipPages":0,"pageSize":1000,"results":1,"resultsWithoutFilter":1,"firstPage":"https://restapi.e-conomic.com/orders/sent?skippages=0&pagesize=1000","lastPage":"https://restapi.e-conomic.com/orders/sent?skippages=0&pagesize=1000"},"metaData":{},"self":"https://restapi.e-conomic.com/orders/sent?skippages=0&pagesize=1000"}
